package com.sys8.sqjzapp.main.tztx;

import java.util.ArrayList;

public class ListData {
    /**
     *通知+提醒信息数据列表
     */
    public static final ArrayList<Tzxx> list_TZTX=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("通知消息","02-03 9:00","通知消息1测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("提醒消息","03-03 10:00","提醒消息1测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("通知消息","02-04 11:00","通知消息2测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("提醒消息","03-04 12:00","提醒消息2测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("通知消息","02-05 13:00","通知消息3测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","0"));
            add(new Tzxx("提醒消息","03-05 14:00","提醒消息3测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","0"));
        }
    };
    /**
     *通知信息数据列表
     */
    public static final ArrayList<Tzxx> list_TZ=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("通知消息","02-03 9:00","通知消息1测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("通知消息","02-04 11:00","通知消息2测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("通知消息","02-05 13:00","通知消息3测试数据","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","0"));
        }
    };
    /**
     *提醒信息数据列表
     */
    public static final ArrayList<Tzxx> list_TX=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("提醒消息","03-03 10:00","提醒消息1测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("提醒消息","03-04 12:00","提醒消息2测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","1"));
            add(new Tzxx("提醒消息","03-05 14:00","提醒消息3测试数据","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所","0"));
        }
    };
}
