package com.sys8.sqjzapp.main.tztx;

import java.util.ArrayList;

public class ListData {
    /**
     *通知+提醒信息数据列表
     */
    public static final ArrayList<Tzxx> list_TZTX=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("通知消息1","2020-02-03 9:00","通知消息1","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("提醒消息1","2020-03-03 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("通知消息2","2020-02-04 9:00","通知消息2","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("提醒消息2","2020-03-04 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("通知消息3","2020-02-05 9:00","通知消息3","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("提醒消息3","2020-03-05 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
        }
    };
    /**
     *通知信息数据列表
     */
    public static final ArrayList<Tzxx> list_TZ=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("通知消息1","2020-02-03 9:00","通知消息1","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("通知消息2","2020-02-04 9:00","通知消息2","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("通知消息3","2020-02-05 9:00","通知消息3","通知消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
        }
    };
    /**
     *提醒信息数据列表
     */
    public static final ArrayList<Tzxx> list_TX=new ArrayList<Tzxx>(){
        {
            add(new Tzxx("提醒消息1","2020-03-03 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("提醒消息2","2020-03-04 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
            add(new Tzxx("提醒消息3","2020-03-05 9:00","","提醒消息测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据测试数据","xxx司法所"));
        }
    };
}
