package com.sys8.sqjzapp.subModule.rcbg;

import java.util.ArrayList;
import java.util.List;

public class RcbgListData {
    /**
     *日常报告数据列表
     */
    public static final List<Rcbg> list_RCBG=new ArrayList<Rcbg>(){
        {
            add(new Rcbg("2020-02-03 9:00","张海洋二月份思想汇报",
                    "缓刑期间，本人思过悔过，充分认识到所犯罪行的严重性，因自身的法制观念、组织纪律观念淡薄," +
                            "这件事，已对造成了社会不好的影响、对自己的家庭带来沉重压力和精神负担。现在，我从思想上进行了" +
                            "深刻的反思，认识到了我的法制观念、组织纪律性确实很淡薄，从而导致自己犯了罪。我要在思想上继" +
                            "深刻的反思，再次加强我的法制观念及组织纪律性，坚决杜绝此类事件的发生\n",
                    "北京市海淀区华北计算技术研究所"));
            add(new Rcbg("2020-03-04 10:00","张海洋三月份思想汇报",
                    "缓刑期间，本人在司法所的领导下，自觉加强理论学习，努力提高政治思想素质和个人业务能力" +
                            "习。主动加强对政治理论知识的学习。在原有的基础上，于xx年2月25日通过司法所社区矫正工作人员人" +
                            "脑入心的讲解，系统的学习了《社区矫正实施办法》，通过学习，提高了自己的政治敏锐性和鉴别能力，" +
                            "坚定了立场，坚定了信念，在大是大非问题面前，能够始终保持清醒的头脑。缓刑期间，我一直在加强法" +
                            "律知识的学习，让自己永远不让这种坏思想再侵蚀自己的灵魂，真正认识到懂法守法的重要性。\n",
                    "北京市海淀区华北计算技术研究所"));
            add(new Rcbg("2020-04-05 13:00","张海洋四月份思想汇报",
                    "我于xx年2月18日参加我所居住村的村道卫生打扫，积极为城乡环境综合治理献上自己的一份力量，为一方村民做" +
                            "些力所能及的公益劳动，本月内我未做违反法律法规的事。当然，在自己的思想、工作、学习等方面还" +
                            "存在着许多的不足：首先，在思想上，还需要进一步加强思想政治学习，深入领会，还需要进一步加大对" +
                            "思想政治理论的学习，不断提高个人的思想理论水平。不断加强对人生观、世界观、价值观的改造。使我" +
                            "深刻的认识到学习的重要性，需要进一步加强对法律知识的学习。今后我要做得更加遵守法律。服从管" +
                            "理、服从监督，增强自己的法制观念及组织纪律性。力争早日成为一名合格的公民。\n",
                    "北京市海淀区华北计算技术研究所"));
        }
    };

}
